def kilkist(arr):
  '''
    дана функція рхує кількість комбінацій відносно кількості 
    елементів в списку
    1 - 1
    2 - 2
    3 - 6
    4 - 24
    5 - 120
    ...
  '''
  res = 1
  for i in range(0,len(arr)):
    res *= (i+1)
  return res

def perm(arr,N,part,sym):
  '''
    1 аргумент - список з яким ми працюємо
    2 аргумент - кількість елеемнтів в цьому списку
    3 аргумент - номер елементу з яким працюємо
                  ['a','b','c']  (a - 1)(b - 2)(c - 3)
    4 аргумент - символ з яким працюємо

    проходимся по списку і додаємо елементри з ліва на право
  '''
  k = 0
  for i in range(0,N):
    if k > part:
      k = 0
    arr[i] = str(arr[i][0:k]) + str(sym) + str(arr[i][k:part])     
    k += 1  
  return arr

s = "123" #список з яким працюжмо

a = ['' for x in range(0,kilkist(s))] 
# створюємо список з довжиною в кількість всіх перестановок

for i in range(0,len(s)):
  perm(a,kilkist(s),i,s[i])
  print(a)
  print("*************")
